import s from './MainInfo.module.css'

function MainInfo(){
    return(
        <div className={s.main}>
            
            <h1>Экзистенциализм: основные идеи и представители</h1> <h2>1. Что такое экзистенциализм?</h2>
<p>Экзистенциализм — философское течение, которое появилось в первой половине XX века и стало одним из наиболее значимых течений XX века. Оно зародилось в ответ на кризис буржуазного мира, проявившийся в двух мировых войнах и финансовых кризисах. Основой экзистенциализма является идея индивидуализма, то есть того, что судьба каждого человека определяется им самим. Экзистенциализм считает, что каждый человек — самостоятельное и единственное существо, которое отвечает за свои поступки и судьбу.</p>

<h2>2. Основные идеи экзистенциализма</h2>
<p>Ангехун: экзистенциализм ставит вопрос о судьбе индивида в безграничном космосе. Именно эта тема составляет основу всех главных работ крупнейших экзистенциалистов, таких как Жан-Поль Сартр, Сёрен Кьеркегорг и Фридрих Ницше.

Абсурд: экзистенциалисты утверждают, что человек оказался в абсурдном мире, где никакие значения, никакие правила не имеют смысла. Это ведет к отчаянию и спрашиванию смысла собственной жизни.

Освобождение: экзистенциализм предлагает освободиться от пустых, лишних мыслей и условностей, что позволит найти смысл собственной жизни.</p>

<h2>3. Выдающиеся представители экзистенциализма</h2>
<p>Жан-Поль Сартр: один из основоположников экзистенциализма. Его работа "Бытие и ничто" является классикой философской литературы. В этом произведении он предлагает концепцию "холостого отношения" — свободного от ограничений отношения к миру.

Фридрих Ницше: также известный как «еврейский Гераклит». В своей книге "Так говорил Заратустра" он развивает идею воли к власти и иерархии в мире.

Сёрен Кьеркегорг: датский философ, оказавший влияние на таких экзистенциалистов, как Жан-Поль Сартр и Альбер Камю. Его основной идеей является понятие "откровения" — непредсказуемого, тревожного состояния души.

Альбер Камю: один из наиболее известных представителей экзистенциализма. В своей книге "Мучение" он описывает постпролетарское общество и стремление индивида найти смысл своей жизни.</p>

<h2>4. Влияние экзистенциализма на культуру и общество</h2>
<p>Идеи экзистенциализма оказали значительное влияние на культуру и общество XX века. В философии они стали отправной точкой для изучения проблемы личности, субъективного опыта и абсурда. В искусстве экзистенциализм повлиял на литературу, театр, кинематограф и музыку, заставляя авторов обращаться к вопросам искажения реальности, бессмысленности и судьбы человека.</p>
        </div>
    )
}

export default MainInfo;